//class template version 5.0 //07.07.2023//



// Class Work 13.09.2023 -------------------------------------------	

 ///////////
/// SQL ///

// SQL = structured quere language

// СУБД = DBMS

// Microsoft SQL = T-SQL (Transact SQL)

// Microsoft ACCESS = свой диалект SQL

/// Модели Баз данных
/*
1. Файловая
2. Иерархическая
3. Сетевая
4. Реляционная (имеет связи между наименованиями полей и записями)
5. Объектно-Ориентированная модель (хранение данных в виде объектов)
*/

/// Реляционная модель
/*
1. Данные в виде таблиц
2. Каждое поле для хранения определенной информации
3. Запись - кортеж
4. Поле - атрибут
*/

 /// 12 Правила Кодда (от 0, т.е. 13)
/*
1. СУБД это СУБДД, если управление БД происходит своими инструментами
2. Правило инфмормации: вся информация хранится только значениями в таблицах
3. Правило гарантированного доступа: есть доступ ко всем элемнтам
4. Правило поддержки недействительных значений: должна быть реализована возможность поддержки неизвестных или отсутствующих значений
5. Правило динамического каталога: доступ к данным БД через единый инструмент (SQL) для любых акторов
6. Правило исчерпывающего подъязыка данных: инструмент работы с БД должен позволять использование всех функций СУБД
7. Правило обновления представлений: представления данных должны быть синхронизированы с БД
8. Правило добавления,обновления и удаления (Create, Request, Update, Delete): операции CRUD проводятся одинаково для одной записи и множества записей
9. Правило независимости физических данных: приложения и пользователи, использующие БД, не должны зависеть от способа хранения информации 
и аппаратного обеспечения компьютеров
10. Правило независимости логических данных: приложения не должны зависеть от структуры БД, изменения в структуре БД не должны влиять на работу приложения
11. Правило независимоти условий целостности: язык СУБДД должен поддерживать проверку входных данных и обеспечивать их целостность
12. Правило независимости распространения: язык СУБДД должен поддерживать возможность работы с распределенными данными
13. Правило единственности: не должно быть возможности работать с данными БД, кроме как через СУБД
*/

// Озера данных (Data Lakes) - средства для анализа от Appache (хадуб?)

 /// Сравнение Microsoft SQL Server c конкурентами
/*
1. Oracle - enterprise решение, под высокую нагрузку
2. MySQL - легковесный сервер SQL. Плохо справляется с BigData (10е6+ / sec)
3. MS SQL Server - есть бесплатная версия для старта, но с плохой миграцией
4. PostGre
*/

 /// Usefull references
/*

1. DB Designer
https://erd.dbdesigner.net/designer/schema/guest_template


*/



// MAIN ------- MAIN ------- MAIN ------- MAIN ------- MAIN --------
int main()
{}


